Tekla Open API Reference for Tekla Structures 2025
Events.TemporaryStatesChanged Event
 Occurs when temporary states are changed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.TemporaryStatesChangedDelegate TemporaryStatesChanged
Public Event TemporaryStatesChanged As Events.TemporaryStatesChangedDelegate
Value
Type: Tekla.Structures.Model.Events.TemporaryStatesChangedDelegate
See Also
Reference
Events Class
Tekla.Structures.Model Namespace